bench/rheotool/cavity_ve_wi1/constant/constitutiveProperties.newtonian
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             Newtonian;

                rho              rho [1 -3 0 0 0 0 0] 1;   // tutorial ships 0.01 (Re = 0.01); Re = rho*U*L/(etaS+etaP) = 1 here
                eta              eta [1 -1 -1 0 0 0 0] 1;   // etaS + etaP of the viscoelastic case                 

                
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
